In [1]:
# CRUD Operations in Pandas.

In [2]:
# Creating a DataFrame from dictionaries

In [3]:
import pandas as pd

A module that was compiled using NumPy 1.x cannot be run in
NumPy 2.0.2 as it may crash. To support both 1.x and 2.x
versions of NumPy, modules must be compiled with NumPy 2.0.
Some module may need to rebuild instead e.g. with 'pybind11>=2.12'.

If you are a user of the module, the easiest solution will be to
downgrade to 'numpy<2' or try to upgrade the affected module.
We expect that some modules will need time to support NumPy 2.

Traceback (most recent call last):  File "<frozen runpy>", line 198, in _run_module_as_main
  File "<frozen runpy>", line 88, in _run_code
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel_launcher.py", line 18, in <module>
    app.launch_new_instance()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\traitlets\config\application.py", line 1075, in launch_instance
    app.start()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelapp.py", line 739, in start
    self.io_loop.start()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\tornado\platform\asyncio.py", line 205, in start
    self.asyncio_loop.run_forever()
  File "c:\Users\dipak\.conda\envs\env2\Lib\asyncio\base_events.py", line 641, in run_forever
    self._run_once()
  File "c:\Users\dipak\.conda\envs\env2\Lib\asyncio\base_events.py", line 1987, in _run_once
    handle._run()
  File "c:\Users\dipak\.conda\envs\env2\Lib\asyncio\events.py", line 88, in _run
    self._context.run(self._callback, *self._args)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 545, in dispatch_queue
    await self.process_one()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 534, in process_one
    await dispatch(*args)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 437, in dispatch_shell
    await result
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\ipkernel.py", line 362, in execute_request
    await super().execute_request(stream, ident, parent)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 778, in execute_request
    reply_content = await reply_content
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\ipkernel.py", line 449, in do_execute
    res = shell.run_cell(
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\zmqshell.py", line 549, in run_cell
    return super().run_cell(*args, **kwargs)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3075, in run_cell
    result = self._run_cell(
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3130, in _run_cell
    result = runner(coro)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\async_helpers.py", line 128, in _pseudo_sync_runner
    coro.send(None)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3334, in run_cell_async
    has_raised = await self.run_ast_nodes(code_ast.body, cell_name,
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3517, in run_ast_nodes
    if await self.run_code(code, result, async_=asy):
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3577, in run_code
    exec(code_obj, self.user_global_ns, self.user_ns)
  File "C:\Users\dipak\AppData\Local\Temp\ipykernel_14676\217833862.py", line 1, in <module>
    import pandas as pd
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\__init__.py", line 62, in <module>
    from pandas.core.api import (
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\api.py", line 28, in <module>
    from pandas.core.arrays import Categorical
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\__init__.py", line 1, in <module>
    from pandas.core.arrays.arrow import ArrowExtensionArray
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\arrow\__init__.py", line 5, in <module>
    from pandas.core.arrays.arrow.array import ArrowExtensionArray
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\arrow\array.py", line 50, in <module>
    from pandas.core import (
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\ops\__init__.py", line 8, in <module>
    from pandas.core.ops.array_ops import (
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\ops\array_ops.py", line 56, in <module>
    from pandas.core.computation import expressions
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\computation\expressions.py", line 21, in <module>
    from pandas.core.computation.check import NUMEXPR_INSTALLED
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\computation\check.py", line 5, in <module>
    ne = import_optional_dependency("numexpr", errors="warn")
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\compat\_optional.py", line 135, in import_optional_dependency
    module = importlib.import_module(name)
  File "c:\Users\dipak\.conda\envs\env2\Lib\importlib\__init__.py", line 90, in import_module
    return _bootstrap._gcd_import(name[level:], package, level)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\numexpr\__init__.py", line 24, in <module>
    from numexpr.interpreter import MAX_THREADS, use_vml, __BLOCK_SIZE1__

AttributeError: _ARRAY_API not found

A module that was compiled using NumPy 1.x cannot be run in
NumPy 2.0.2 as it may crash. To support both 1.x and 2.x
versions of NumPy, modules must be compiled with NumPy 2.0.
Some module may need to rebuild instead e.g. with 'pybind11>=2.12'.

If you are a user of the module, the easiest solution will be to
downgrade to 'numpy<2' or try to upgrade the affected module.
We expect that some modules will need time to support NumPy 2.

Traceback (most recent call last):  File "<frozen runpy>", line 198, in _run_module_as_main
  File "<frozen runpy>", line 88, in _run_code
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel_launcher.py", line 18, in <module>
    app.launch_new_instance()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\traitlets\config\application.py", line 1075, in launch_instance
    app.start()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelapp.py", line 739, in start
    self.io_loop.start()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\tornado\platform\asyncio.py", line 205, in start
    self.asyncio_loop.run_forever()
  File "c:\Users\dipak\.conda\envs\env2\Lib\asyncio\base_events.py", line 641, in run_forever
    self._run_once()
  File "c:\Users\dipak\.conda\envs\env2\Lib\asyncio\base_events.py", line 1987, in _run_once
    handle._run()
  File "c:\Users\dipak\.conda\envs\env2\Lib\asyncio\events.py", line 88, in _run
    self._context.run(self._callback, *self._args)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 545, in dispatch_queue
    await self.process_one()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 534, in process_one
    await dispatch(*args)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 437, in dispatch_shell
    await result
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\ipkernel.py", line 362, in execute_request
    await super().execute_request(stream, ident, parent)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 778, in execute_request
    reply_content = await reply_content
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\ipkernel.py", line 449, in do_execute
    res = shell.run_cell(
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\zmqshell.py", line 549, in run_cell
    return super().run_cell(*args, **kwargs)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3075, in run_cell
    result = self._run_cell(
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3130, in _run_cell
    result = runner(coro)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\async_helpers.py", line 128, in _pseudo_sync_runner
    coro.send(None)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3334, in run_cell_async
    has_raised = await self.run_ast_nodes(code_ast.body, cell_name,
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3517, in run_ast_nodes
    if await self.run_code(code, result, async_=asy):
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3577, in run_code
    exec(code_obj, self.user_global_ns, self.user_ns)
  File "C:\Users\dipak\AppData\Local\Temp\ipykernel_14676\217833862.py", line 1, in <module>
    import pandas as pd
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\__init__.py", line 62, in <module>
    from pandas.core.api import (
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\api.py", line 28, in <module>
    from pandas.core.arrays import Categorical
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\__init__.py", line 1, in <module>
    from pandas.core.arrays.arrow import ArrowExtensionArray
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\arrow\__init__.py", line 5, in <module>
    from pandas.core.arrays.arrow.array import ArrowExtensionArray
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\arrow\array.py", line 64, in <module>
    from pandas.core.arrays.masked import BaseMaskedArray
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\masked.py", line 60, in <module>
    from pandas.core import (
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\nanops.py", line 52, in <module>
    bn = import_optional_dependency("bottleneck", errors="warn")
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\compat\_optional.py", line 135, in import_optional_dependency
    module = importlib.import_module(name)
  File "c:\Users\dipak\.conda\envs\env2\Lib\importlib\__init__.py", line 90, in import_module
    return _bootstrap._gcd_import(name[level:], package, level)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\bottleneck\__init__.py", line 7, in <module>
    from .move import (move_argmax, move_argmin, move_max, move_mean, move_median,

ImportError:
A module that was compiled using NumPy 1.x cannot be run in
NumPy 2.0.2 as it may crash. To support both 1.x and 2.x
versions of NumPy, modules must be compiled with NumPy 2.0.
Some module may need to rebuild instead e.g. with 'pybind11>=2.12'.

If you are a user of the module, the easiest solution will be to
downgrade to 'numpy<2' or try to upgrade the affected module.
We expect that some modules will need time to support NumPy 2.

In [4]:
data = {
    "Name":["Narshima","Ram","Krishna","Kalki"],
    "Yuga":["Satya","Treta","Dwapar","kali"],
    "Time Period":[4,3,2,1],
    "Demon Defeated":["Hyranyakashifu","Rawan","Kanshik","kali Purush"]
}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

       Name    Yuga  Time Period  Demon Defeated
0  Narshima   Satya            4  Hyranyakashifu
1       Ram   Treta            3           Rawan
2   Krishna  Dwapar            2         Kanshik
3     Kalki    kali            1     kali Purush

In [7]:
# Creating a dataFrame from a list

In [8]:
Name=["Narshima","Ram","Krishna","Kalki"]
Yuga=["Satya","Treta","Dwapar","kali"]
Time_Period=[4,3,2,1]
Demon_Defeated=["Hyranyakashifu","Rawan","Kanshik","kali Purush"]

In [10]:
df = pd.DataFrame({
    "Gods":Name,
    "Yuga":Yuga,
    "Time Period":Time_Period,
    "Demon Defeated":Demon_Defeated
})

In [11]:
df

       Gods    Yuga  Time Period  Demon Defeated
0  Narshima   Satya            4  Hyranyakashifu
1       Ram   Treta            3           Rawan
2   Krishna  Dwapar            2         Kanshik
3     Kalki    kali            1     kali Purush

In [12]:
# Creating a dataframe from a csv files.

In [16]:
data = pd.read_csv("car.csv")

In [17]:
df = pd.DataFrame(data)

In [18]:
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [19]:
# Second Operations: Reading a dataFrame

In [20]:
df.head(5)

print()

df.tail(2)

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual,First Owner
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual,First Owner

In [22]:
# Explore the column of the datasets

In [23]:
df.columns

Index(['name', 'year', 'selling_price', 'km_driven', 'fuel', 'seller_type',
       'transmission', 'owner'],
      dtype='object')

In [24]:
# Check the data types with dtypes

In [25]:
df.dtypes

name             object
year              int64
selling_price     int64
km_driven         int64
fuel             object
seller_type      object
transmission     object
owner            object
dtype: object

In [26]:
# Generate the descriptive statistics

In [27]:
df.describe()

              year  selling_price      km_driven
count  4340.000000   4.340000e+03    4340.000000
mean   2013.090783   5.041273e+05   66215.777419
std       4.215344   5.785487e+05   46644.102194
min    1992.000000   2.000000e+04       1.000000
25%    2011.000000   2.087498e+05   35000.000000
50%    2014.000000   3.500000e+05   60000.000000
75%    2016.000000   6.000000e+05   90000.000000
max    2020.000000   8.900000e+06  806599.000000

In [28]:
df['name'].head()

0               Maruti 800 AC
1    Maruti Wagon R LXI Minor
2        Hyundai Verna 1.6 SX
3      Datsun RediGO T Option
4       Honda Amaze VX i-DTEC
Name: name, dtype: object

In [29]:
# access the multiples columns

In [30]:
df[["name","year","selling_price"]]

                                     name  year  selling_price
0                           Maruti 800 AC  2007          60000
1                Maruti Wagon R LXI Minor  2007         135000
2                    Hyundai Verna 1.6 SX  2012         600000
3                  Datsun RediGO T Option  2017         250000
4                   Honda Amaze VX i-DTEC  2014         450000
...                                   ...   ...            ...
4335  Hyundai i20 Magna 1.4 CRDi (Diesel)  2014         409999
4336           Hyundai i20 Magna 1.4 CRDi  2014         409999
4337                  Maruti 800 AC BSIII  2009         110000
4338     Hyundai Creta 1.6 CRDi SX Option  2016         865000
4339                     Renault KWID RXT  2016         225000

[4340 rows x 3 columns]

In [32]:
# Find the unique values in the column: 

df["name"].unique()

array(['Maruti 800 AC', 'Maruti Wagon R LXI Minor',
       'Hyundai Verna 1.6 SX', ..., 'Mahindra Verito 1.5 D6 BSIII',
       'Toyota Innova 2.5 VX (Diesel) 8 Seater BS IV',
       'Hyundai i20 Magna 1.4 CRDi'], dtype=object)

In [34]:
# Filtering rows:
df[df["selling_price"] > 60000]

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner
5,Maruti Alto LX BSIII,2007,140000,125000,Petrol,Individual,Manual,First Owner
...,...,...,...,...,...,...,...,...
4335,Hyundai i20 Magna 1.4 CRDi (Diesel),2014,409999,80000,Diesel,Individual,Manual,Second Owner
4336,Hyundai i20 Magna 1.4 CRDi,2014,409999,80000,Diesel,Individual,Manual,Second Owner
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual,Second Owner
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual,First Owner
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual,First Owner

In [35]:
# Filtering the data with multiple conditions:

In [44]:
new_data = df[(df["selling_price"] > 60000) & (df["km_driven"]<50000) & (df["transmission"]=="Manual")]

In [46]:
print(new_data)

                                 name  year  selling_price  km_driven    fuel  \
3              Datsun RediGO T Option  2017         250000      46000  Petrol
6           Hyundai Xcent 1.2 Kappa S  2016         550000      25000  Petrol
8            Hyundai Creta 1.6 VTVT S  2015         850000      25000  Petrol
10            Chevrolet Sail 1.2 Base  2015         260000      35000  Petrol
16             Datsun RediGO T Option  2017         250000      46000  Petrol
...                               ...   ...            ...        ...     ...
4310  Renault Duster 110PS Diesel RxL  2015         465000      41123  Diesel
4312            Maruti Ertiga 1.5 VDI  2019        1000000      15000  Diesel
4315               Maruti Celerio ZXI  2017         415000      20000  Petrol
4324             Maruti Alto 800 Base  2015         155000      40000  Petrol
4339                 Renault KWID RXT  2016         225000      40000  Petrol

     seller_type transmission        owner
3     Individual       Manual  First Owner
6     Individual       Manual  First Owner
8     Individual       Manual  First Owner
10    Individual       Manual  First Owner
16    Individual       Manual  First Owner
...          ...          ...          ...
4310      Dealer       Manual  First Owner
4312  Individual       Manual  First Owner
4315  Individual       Manual  First Owner
4324  Individual       Manual  First Owner
4339  Individual       Manual  First Owner

[1355 rows x 8 columns]

In [52]:
# Get the number of rows
new_data["name"].count()

np.int64(1355)

In [53]:
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [55]:
df.iloc[0]

name             Maruti 800 AC
year                      2007
selling_price            60000
km_driven                70000
fuel                    Petrol
seller_type         Individual
transmission            Manual
owner              First Owner
Name: 0, dtype: object

In [59]:
df.iloc[0,1]

np.int64(2007)

In [60]:
df.iloc[1:3]

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner

In [61]:
df.set_index("year", inplace=True)

In [63]:
print(df.loc[2007])

                          name  selling_price  km_driven    fuel seller_type  \
year
2007             Maruti 800 AC          60000      70000  Petrol  Individual
2007  Maruti Wagon R LXI Minor         135000      50000  Petrol  Individual
2007      Maruti Alto LX BSIII         140000     125000  Petrol  Individual
2007             Maruti 800 AC          60000      70000  Petrol  Individual
2007  Maruti Wagon R LXI Minor         135000      50000  Petrol  Individual
...                        ...            ...        ...     ...         ...
2007          Maruti Swift VDI         225000      50000  Diesel      Dealer
2007  Maruti Wagon R LXI Minor         140000      49000  Petrol      Dealer
2007      Maruti SX4 Zxi BSIII         160000      80000  Petrol  Individual
2007        Honda City 1.5 GXI         190000     115000  Petrol      Dealer
2007        Honda City 1.5 GXI         190000     115000  Petrol      Dealer

     transmission         owner
year
2007       Manual   First Owner
2007       Manual   First Owner
2007       Manual   First Owner
2007       Manual   First Owner
2007       Manual   First Owner
...           ...           ...
2007       Manual   First Owner
2007       Manual   First Owner
2007       Manual   Third Owner
2007       Manual  Second Owner
2007       Manual  Second Owner

[134 rows x 7 columns]

In [64]:
# Update Operations: MOdifying data in Pandas

In [66]:
mini_data = {

    "Name":['Eve', 'Jack', 'Charlie', 'Henry', 'John'],
    "Age":[25, 30, 35, 40, 45],
    "City":['NY', 'LA', 'SF', 'Houston', 'Seattle'],
}

df = pd.DataFrame(mini_data)

In [67]:
df.head()

      Name  Age     City
0      Eve   25       NY
1     Jack   30       LA
2  Charlie   35       SF
3    Henry   40  Houston
4     John   45  Seattle

In [68]:
df.loc[df["Name"]=="Jack", "Age"] = 42

In [69]:
df.head()

      Name  Age     City
0      Eve   25       NY
1     Jack   42       LA
2  Charlie   35       SF
3    Henry   40  Houston
4     John   45  Seattle

In [70]:
df["City"] = ['Boston', 'Chicago', 'LA', 'Austin', 'Miami']

In [71]:
df.head()

      Name  Age     City
0      Eve   25   Boston
1     Jack   42  Chicago
2  Charlie   35       LA
3    Henry   40   Austin
4     John   45    Miami

In [72]:
# Update based on conditions:

df.loc[df["City"] == "LA","Age"] = 31

In [73]:
df.head()

      Name  Age     City
0      Eve   25   Boston
1     Jack   42  Chicago
2  Charlie   31       LA
3    Henry   40   Austin
4     John   45    Miami

In [74]:
data = {'Name': ['Eve', 'Jack', 'Charlie', 'Henry', 'John'],
        'Age': [25, 30, 35, 40, 45],
        'City': ['NY', 'LA', 'SF', 'Houston', 'Seattle']}

df = pd.DataFrame(data)

In [75]:
# Delete a column: 

df = df.drop("City", axis=1)

In [76]:
df.head()

      Name  Age
0      Eve   25
1     Jack   30
2  Charlie   35
3    Henry   40
4     John   45

In [77]:
# Delete a row

df = df.drop(2, axis=0)

In [78]:
df.head()

    Name  Age
0    Eve   25
1   Jack   30
3  Henry   40
4   John   45

In [81]:
df = df[df["Age"]!=45]

In [82]:
df.head()

    Name  Age
0    Eve   25
1   Jack   30
3  Henry   40

In [83]:
del df

In [84]:
print(df)

NameError: name 'df' is not defined